clear
clc
T=[1790 1800 1810 1820 1830 1840 1850 1860 1870 1880 1890 1900 1910 1920 1930 1940 1950 1960 1970 1980];
N=[3.9 5.3 7.2 9.6 12.9 17.1 23.2 31.4 38.6 50.2 62.9 76.0 92.0 106.5 123.2 131.7 150.7 179.3 204.0 226.5];

p1=0.00651;
p2=-23.39;
p3=21020;
N_L=p1*T.^2+p2*T+p3;

year=[1990 2000 2010 2020];
num=[248.7 281.4 310.2 326.8];

p_N=p1*year.^2+p2*year+p3;

figure
plot(T,N,'-*' ,'LineWidth',1.5)
hold on
plot(year,num,'-p' ,'LineWidth',1.5)
plot(T,N_L,'-o' ,'LineWidth',1.5)
plot(year,p_N,'-s' ,'LineWidth',1.5)
xlabel('年份')
ylabel('人口(*10^6)')
legend('1790-1980美国实际人口','1990-2020美国实际人口','线性多项式拟合人口','线性多项式预测人口')

